---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.RegenerationFailedException
source: html/928f3b7c-56d2-cd99-32f2-c0fe061b1278.htm
---
# RegenerationFailedException Members

Retrieves data needed to serialize the target object.